src/cfe/КСП/InformationRegisters/КСП_СвязьРеализацийУППиЦепочекПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_СвязьРеализацийУППиЦепочекПеремещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаказНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходныйОрдерНаТовары</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРТУ</Name>
					<Comment>из УПП: номер + дата</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИмпорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГУИД</Name>
					<Comment>гуид док-а РеализацияТоваровУслуг (УПП)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_СвязьРеализацийУППиЦепочекПеремещений/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	ВнешняяСистема 	- строка - например, "upp"
//	ГУИД - строка, 36 - гуид док-а РеализацияТоваровУслуг и УПП
//	
//
Процедура ДобавитьЗапись(ВнешняяСистема, ГУИД,ЗаказНаПеремещение,ПеремещениеТоваров,РасходныйОрдерНаТовары, ПредставлениеРТУ,Комментарий) Экспорт
	
	НЗ = РегистрыСведений.КСП_СвязьРеализацийУППиЦепочекПеремещений.СоздатьНаборЗаписей();
	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НЗ.Отбор.ГУИД.Установить(ГУИД);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ГУИД = ГУИД;
	НовСтр.ЗаказНаПеремещение = ЗаказНаПеремещение;
	НовСтр.ПеремещениеТоваров = ПеремещениеТоваров;
	НовСтр.РасходныйОрдерНаТовары = РасходныйОрдерНаТовары;
	НовСтр.ПредставлениеРТУ = ПредставлениеРТУ;
	НовСтр.Комментарий = Комментарий;
	НовСтр.ДатаИмпорта = ТекущаяДатаСеанса();
	
	НЗ.Записать();
		
КонецПроцедуры
